In [28]:
#michael is sus

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats as stat

In [29]:
company_tweet = pd.read_csv('Data/Tweets/Company_Tweet.csv')
tweet = pd.read_csv('Data/Tweets/Tweet.csv')
company = pd.read_csv('Data/Tweets/Company.csv')
company_value = pd.read_csv('Data/CompanyStocks/CompanyValues.csv')

In [30]:
def quick_analysis(df):
    print("Data info:")
    print(df.info())
    print("-------------****----------------\n\nData Types:")
    print(df.dtypes)
    print("-------------****----------------\n\nRows and Columns:")
    print(df.shape)
    print("-------------****----------------\n\nColumn names:")
    print(df.columns)
    print("-------------****----------------\n\nNull Values:")
    print(df.apply(lambda x: sum(x.isnull()) / len(df)))
    print("-------------****----------------\n\nUnique values:")
    print(df.nunique())
    print("-------------****----------------\n\nDescribes:")
    print(df.describe())
    print("-------------****----------------\n\nHead:")
    print(df.head())

In [31]:
#Do a sentiment analysis on the tweets

quick_analysis(tweet)

Data info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3717964 entries, 0 to 3717963
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   tweet_id     int64
 1   writer       object
 2   post_date    int64
 3   body         object
 4   comment_num  int64
 5   retweet_num  int64
 6   like_num     int64
dtypes: int64(5), object(2)
memory usage: 198.6+ MB
None
-------------****----------------

Data Types:
tweet_id        int64
writer         object
post_date       int64
body           object
comment_num     int64
retweet_num     int64
like_num        int64
dtype: object
-------------****----------------

Rows and Columns:
(3717964, 7)
-------------****----------------

Column names:
Index(['tweet_id', 'writer', 'post_date', 'body', 'comment_num', 'retweet_num',
       'like_num'],
      dtype='object')
-------------****----------------

Null Values:
tweet_id       0.000000
writer         0.012715
post_date      0.000000
body           0.000000
comment_num    0.000000
retweet_num    0.000000
like_num       0.000000
dtype: float64
-------------****----------------

Unique values:
tweet_id       3717964
writer          140131
post_date      3421363
body           3326194
comment_num        191
retweet_num        509
like_num           783
dtype: int64
-------------****----------------

Describes:
           tweet_id     post_date   comment_num   retweet_num      like_num
count  3.717964e+06  3.717964e+06  3.717964e+06  3.717964e+06  3.717964e+06
mean   8.797444e+17  1.498582e+09  3.123642e-01  6.214807e-01  2.219982e+00
std    1.924039e+17  4.587266e+07  1.966064e+00  7.009571e+00  1.429093e+01
min    5.504415e+17  1.420070e+09  0.000000e+00  0.000000e+00  0.000000e+00
25%    7.169886e+17  1.459778e+09  0.000000e+00  0.000000e+00  0.000000e+00
50%    8.743180e+17  1.497289e+09  0.000000e+00  0.000000e+00  0.000000e+00
75%    1.050771e+18  1.539358e+09  0.000000e+00  0.000000e+00  1.000000e+00
max    1.212160e+18  1.577837e+09  6.310000e+02  9.990000e+02  9.990000e+02
-------------****----------------

Head:
             tweet_id           writer   post_date  \
0  550441509175443456  VisualStockRSRC  1420070457
1  550441672312512512      KeralaGuy77  1420070496
2  550441732014223360      DozenStocks  1420070510
3  550442977802207232     ShowDreamCar  1420070807
4  550443807834402816     i_Know_First  1420071005

                                                body  comment_num  \
0  lx21 made $10,008  on $AAPL -Check it out! htt...            0
1  Insanity of today weirdo massive selling. $aap...            0
2  S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...            0
3  $GM $TSLA: Volkswagen Pushes 2014 Record Recal...            0
4  Swing Trading: Up To 8.91% Return In 14 Days h...            0

   retweet_num  like_num
0            0         1
1            0         0
2            0         0
3            0         1
4            0         1

In [32]:
tweet.head()

,tweet_id,writer,post_date,body,comment_num,retweet_num,like_num
0,550441509175443456,VisualStockRSRC,1420070457,"lx21 made $10,008 on $AAPL -Check it out! htt...",0,0,1
1,550441672312512512,KeralaGuy77,1420070496,Insanity of today weirdo massive selling. $aap...,0,0,0
2,550441732014223360,DozenStocks,1420070510,S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...,0,0,0
3,550442977802207232,ShowDreamCar,1420070807,$GM $TSLA: Volkswagen Pushes 2014 Record Recal...,0,0,1
4,550443807834402816,i_Know_First,1420071005,Swing Trading: Up To 8.91% Return In 14 Days h...,0,0,1

In [33]:
 company_tweet.head()

             tweet_id ticker_symbol
0  550803612197457920          AAPL
1  550803610825928706          AAPL
2  550803225113157632          AAPL
3  550802957370159104          AAPL
4  550802855129382912          AAPL

In [34]:
company_value.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
0,AAPL,2020-05-29,317.94,38399530,319.25,321.15,316.47
1,AAPL,2020-05-28,318.25,33449100,316.77,323.44,315.63
2,AAPL,2020-05-27,318.11,28236270,316.14,318.71,313.09
3,AAPL,2020-05-26,316.73,31380450,323.50,324.24,316.50
4,AAPL,2020-05-22,318.89,20450750,315.77,319.23,315.35

In [35]:
company.head()

  ticker_symbol company_name
0          AAPL        apple
1          GOOG   Google Inc
2         GOOGL   Google Inc
3          AMZN   Amazon.com
4          TSLA    Tesla Inc

In [36]:
#merge company tweets and tweets on id
tweet_df = pd.merge(company_tweet , tweet , on="tweet_id", how= "inner")

In [37]:
#create variable 'total_engagement'
tweet_df["total_engangement"] = tweet_df["comment_num"] + tweet_df["retweet_num"] + tweet_df["like_num"]
#remove tweets below certain engagement
engagement_threshold = 40
tweet_df = tweet_df[tweet_df["total_engangement"] > engagement_threshold]
tweet_df.head()
print('tweet count: ', tweet_df.size)

,tweet_id,ticker_symbol,writer,post_date,body,comment_num,retweet_num,like_num,total_engangement
40,550781053137616896,AAPL,CNBC,1420151410,This is Wall Street's top pick in 2015. Hint: ...,5,37,22,64
47,550779709840445441,AAPL,WSJ,1420151090,"See how tech companies like Apple, Twitter and...",15,223,109,347
242,550650451948212224,AAPL,greatspoke,1420120272,Top Stock Analyst Releases Report on Top Stock...,0,431,2,433
243,550650235404701697,AAPL,greatspoke,1420120221,Analyst Report on Top Stock Market Options for...,0,430,3,433
244,550650235404701697,AMZN,greatspoke,1420120221,Analyst Report on Top Stock Market Options for...,0,430,3,433

In [39]:
#convert original time on tweet_df to date time
tweet_df['post_date'] = pd.to_datetime(tweet_df['post_date'], unit='s')
tweet_df['day_date'] = pd.to_datetime(tweet_df['post_date'].apply(lambda date: date.date()))

In [41]:
#order chronilogically
tweet_df = tweet_df.sort_values(by="day_date")

In [42]:
tweet_df.head()

,tweet_id,ticker_symbol,writer,post_date,body,comment_num,retweet_num,like_num,total_engangement,day_date
40,550781053137616896,AAPL,CNBC,2015-01-01 22:30:10,This is Wall Street's top pick in 2015. Hint: ...,5,37,22,64,2015-01-01
47,550779709840445441,AAPL,WSJ,2015-01-01 22:24:50,"See how tech companies like Apple, Twitter and...",15,223,109,347,2015-01-01
242,550650451948212224,AAPL,greatspoke,2015-01-01 13:51:12,Top Stock Analyst Releases Report on Top Stock...,0,431,2,433,2015-01-01
243,550650235404701697,AAPL,greatspoke,2015-01-01 13:50:21,Analyst Report on Top Stock Market Options for...,0,430,3,433,2015-01-01
244,550650235404701697,AMZN,greatspoke,2015-01-01 13:50:21,Analyst Report on Top Stock Market Options for...,0,430,3,433,2015-01-01

In [43]:
#convert time value on company stock data to date time
stock_df = company_value
stock_df['day_date']  = pd.to_datetime(stock_df['day_date'])
stock_df.sample(5)

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
10300,GOOG,2016-04-05,737.80,1130817,738.00,742.800,735.37
6060,AMZN,2019-01-12,1640.56,4670093,1640.55,1660.294,1636.22
6406,GOOGL,2019-06-21,1125.37,2538872,1109.86,1126.570,1109.72
1385,AAPL,2014-11-25,117.60,68719930,119.07,119.750,117.45
93,AAPL,2020-01-15,311.34,30480880,311.85,315.500,309.55

In [49]:
#drop un-needed features
tweet_df = tweet_df.drop(['tweet_id', 'post_date', 'comment_num', 'retweet_num', 'like_num'], axis=1)

In [45]:
#remove any stock data that is outside of the tweet data
start_day = min(tweet_df['day_date'])
print(f"Start day: {start_day}")

end_day = max(tweet_df['day_date'])
print(f"End day: {end_day}")

Start day: 2015-01-01 00:00:00
End day: 2019-12-31 00:00:00

In [46]:
stock_df = stock_df[(stock_df['day_date'] >= start_day) & (stock_df['day_date'] <= end_day)]

In [47]:
#sort stock data chronilogically
stock_df = stock_df.sort_values(by="day_date")
stock_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
2517,AAPL,2015-01-01,110.38,41304780,112.82,113.13,110.21
10810,GOOG,2015-01-01,526.40,1367110,531.25,532.60,525.80
8687,GOOGL,2015-01-01,530.66,1235889,537.74,538.40,530.20
16960,TSLA,2015-01-01,222.41,2392947,223.09,225.68,222.25
5602,AMZN,2015-01-01,310.35,2048676,311.55,312.98,310.01

In [50]:
tweet_df.head()

,ticker_symbol,writer,body,total_engangement,day_date
40,AAPL,CNBC,This is Wall Street's top pick in 2015. Hint: ...,64,2015-01-01
47,AAPL,WSJ,"See how tech companies like Apple, Twitter and...",347,2015-01-01
242,AAPL,greatspoke,Top Stock Analyst Releases Report on Top Stock...,433,2015-01-01
243,AAPL,greatspoke,Analyst Report on Top Stock Market Options for...,433,2015-01-01
244,AMZN,greatspoke,Analyst Report on Top Stock Market Options for...,433,2015-01-01

In [81]:
APPL_df = stock_df.loc[stock_df['ticker_symbol'] == 'AAPL']

GOOG_df = stock_df.loc[stock_df['ticker_symbol'] == 'GOOG']
GOOGL_df = stock_df.loc[stock_df['ticker_symbol'] == 'GOOGL']


TSLA_df = stock_df.loc[stock_df['ticker_symbol'] == 'TSLA']
AMZN_df = stock_df.loc[stock_df['ticker_symbol'] == 'AMZN']

In [82]:
APPL_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
2517,AAPL,2015-01-01,110.38,41304780,112.82,113.13,110.21
1360,AAPL,2015-01-02,109.33,53143770,111.39,111.44,107.35
2518,AAPL,2015-01-03,109.33,53143770,111.39,111.44,107.35
2519,AAPL,2015-01-04,109.33,53143770,111.39,111.44,107.35
1359,AAPL,2015-01-05,106.25,64210880,108.29,108.65,105.41

In [83]:
GOOG_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
10810,GOOG,2015-01-01,526.40,1367110,531.25,532.60,525.80
10615,GOOG,2015-01-02,524.81,1444809,529.01,531.27,524.10
10811,GOOG,2015-01-03,524.81,1444809,529.01,531.27,524.10
10812,GOOG,2015-01-04,524.81,1444809,529.01,531.27,524.10
10614,GOOG,2015-01-05,513.87,2049303,523.26,524.33,513.06

In [84]:
#there are two types of google stocks, one has voting power in the company while the other doesnt
GOOGL_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
8687,GOOGL,2015-01-01,530.66,1235889,537.74,538.4000,530.20
7530,GOOGL,2015-01-02,529.55,1325271,532.60,535.8000,527.88
8688,GOOGL,2015-01-03,529.55,1325271,532.60,535.8000,527.88
8689,GOOGL,2015-01-04,529.55,1325271,532.60,535.8000,527.88
7529,GOOGL,2015-01-05,519.46,2054120,527.15,527.9899,517.75

In [79]:
TSLA_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
16960,TSLA,2015-01-01,222.41,2392947,223.09,225.68,222.2500
15823,TSLA,2015-01-02,219.31,4753239,222.87,223.25,213.2600
16961,TSLA,2015-01-03,219.31,4753239,222.87,223.25,213.2600
16962,TSLA,2015-01-04,219.31,4753239,222.87,223.25,213.2600
15822,TSLA,2015-01-05,210.09,5355485,214.55,216.50,207.1626

In [80]:
AMZN_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
5602,AMZN,2015-01-01,310.35,2048676,311.55,312.98,310.0100
4445,AMZN,2015-01-02,308.52,2785167,312.58,314.75,306.9601
5603,AMZN,2015-01-03,308.52,2785167,312.58,314.75,306.9601
5604,AMZN,2015-01-04,308.52,2785167,312.58,314.75,306.9601
4444,AMZN,2015-01-05,302.19,2768215,307.01,308.38,300.8500